In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

In [3]:
data

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

In [4]:
data = pd.read_csv('test.csv', header=0)

In [5]:
data

   Number       Birth       City          Name  Position
0       1  22.03.1980     Москва   Иванов А.А.       NaN
1       2  26.04.1967  Волгоград  Сорокин И.В.   инженер
2       3  22.08.1999     Ростов    Белов М.М.  менеджер
3       5  14.10.1993     Москва   Рыбина Е.Л.   инженер
4       6  10.12.1996     Москва  Костров С.О.    стажер

In [7]:
data.columns

Index(['Number', 'Birth', 'City', 'Name', 'Position'], dtype='object')

In [8]:
data.shape

(5, 5)

In [9]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Minusinsk'}

In [11]:
data = data.append(new_line, ignore_index=True)

In [12]:
data

   Number       Birth       City          Name  Position
0     1.0  22.03.1980     Москва   Иванов А.А.       NaN
1     2.0  26.04.1967  Волгоград  Сорокин И.В.   инженер
2     3.0  22.08.1999     Ростов    Белов М.М.  менеджер
3     5.0  14.10.1993     Москва   Рыбина Е.Л.   инженер
4     6.0  10.12.1996     Москва  Костров С.О.    стажер
5     NaN  22.03.1990  Minusinsk         Perov       NaN

In [13]:
data['IsStudent'] = [False] * 4 + [True] * 2

In [14]:
data

   Number       Birth       City          Name  Position  IsStudent
0     1.0  22.03.1980     Москва   Иванов А.А.       NaN      False
1     2.0  26.04.1967  Волгоград  Сорокин И.В.   инженер      False
2     3.0  22.08.1999     Ростов    Белов М.М.  менеджер      False
3     5.0  14.10.1993     Москва   Рыбина Е.Л.   инженер      False
4     6.0  10.12.1996     Москва  Костров С.О.    стажер       True
5     NaN  22.03.1990  Minusinsk         Perov       NaN       True

In [16]:
data.drop([3, 4], axis=0)

   Number       Birth       City          Name  Position  IsStudent
0     1.0  22.03.1980     Москва   Иванов А.А.       NaN      False
1     2.0  26.04.1967  Волгоград  Сорокин И.В.   инженер      False
2     3.0  22.08.1999     Ростов    Белов М.М.  менеджер      False
5     NaN  22.03.1990  Minusinsk         Perov       NaN       True

In [17]:
data

   Number       Birth       City          Name  Position  IsStudent
0     1.0  22.03.1980     Москва   Иванов А.А.       NaN      False
1     2.0  26.04.1967  Волгоград  Сорокин И.В.   инженер      False
2     3.0  22.08.1999     Ростов    Белов М.М.  менеджер      False
3     5.0  14.10.1993     Москва   Рыбина Е.Л.   инженер      False
4     6.0  10.12.1996     Москва  Костров С.О.    стажер       True
5     NaN  22.03.1990  Minusinsk         Perov       NaN       True

In [18]:
data.drop([4, 5], axis=0, inplace=True)

In [19]:
data

   Number       Birth       City          Name  Position  IsStudent
0     1.0  22.03.1980     Москва   Иванов А.А.       NaN      False
1     2.0  26.04.1967  Волгоград  Сорокин И.В.   инженер      False
2     3.0  22.08.1999     Ростов    Белов М.М.  менеджер      False
3     5.0  14.10.1993     Москва   Рыбина Е.Л.   инженер      False

In [20]:
data.drop('IsStudent', axis=1, inplace=True)

In [21]:
data

   Number       Birth       City          Name  Position
0     1.0  22.03.1980     Москва   Иванов А.А.       NaN
1     2.0  26.04.1967  Волгоград  Сорокин И.В.   инженер
2     3.0  22.08.1999     Ростов    Белов М.М.  менеджер
3     5.0  14.10.1993     Москва   Рыбина Е.Л.   инженер

In [22]:
data.to_csv('new_data.csv', sep=',', header=True, index=None)

In [23]:
!cat new_data.csv

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [24]:
new_data = pd.read_csv('new_data.csv')

In [25]:
new_data

   Number       Birth       City          Name  Position
0     1.0  22.03.1980     Москва   Иванов А.А.       NaN
1     2.0  26.04.1967  Волгоград  Сорокин И.В.   инженер
2     3.0  22.08.1999     Ростов    Белов М.М.  менеджер
3     5.0  14.10.1993     Москва   Рыбина Е.Л.   инженер